Description of data set found here: https://archive.ics.uci.edu/ml/datasets/default+of+credit+card+clients

Questions we can ask:

In [45]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_excel("default of credit card clients.xls", skiprows = 1)

In [3]:
data.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [4]:
#relabeling data for clarity
data.EDUCATION = data.EDUCATION.map({1: 'graduate school', 2: 'university', 3: 'high school', 4: 'others'})
data.MARRIAGE = data.MARRIAGE.map({1: 'married', 2: 'single', 3: 'others'})
data.SEX = data.SEX.apply(lambda x: "MALE" if x == 1 else "FEMALE")

In [5]:
data.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,FEMALE,university,married,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,FEMALE,university,single,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,FEMALE,university,single,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,FEMALE,university,married,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,MALE,university,married,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [6]:
#Group by sex
sex_gp = data.groupby('SEX')
print "Median debt\n"
print sex_gp.LIMIT_BAL.median()
print "\nTotal number of default payments/Total number of loans"
print "\n", sex_gp['default payment next month'].mean()

Median debt

SEX
FEMALE    150000
MALE      130000
Name: LIMIT_BAL, dtype: int64

Total number of default payments/Total number of loans

SEX
FEMALE    0.207763
MALE      0.241672
Name: default payment next month, dtype: float64

In [7]:
#Group by education
sex_gp = data.groupby('EDUCATION')
print "Median debt\n"
print sex_gp.LIMIT_BAL.median()
print "\nTotal number of default payments/Total number of loans"
print "\n", sex_gp['default payment next month'].mean()

Median debt

EDUCATION
graduate school    200000
high school         80000
others             200000
university         110000
Name: LIMIT_BAL, dtype: int64

Total number of default payments/Total number of loans

EDUCATION
graduate school    0.192348
high school        0.251576
others             0.056911
university         0.237349
Name: default payment next month, dtype: float64

In [8]:
#group by age bracket
def agebracket(x):
    if x >= 18 and x <= 24:
        return "18-24"
    elif x >= 25 and x <= 34:
        return "25-34"
    elif x >= 35 and x <= 44:
        return "35-44"
    elif x >= 45 and x <= 54:
        return "45-54"
    elif x >= 55:
        return "55+"
    
data['Age Bracket'] = data.AGE.apply(lambda x: agebracket(x))
agebr_gp = data.groupby('Age Bracket')
print "Median debt\n"
print agebr_gp.LIMIT_BAL.median()
print "\nLikelihood of default"
print "\n", agebr_gp['default payment next month'].mean()

Median debt

Age Bracket
18-24     50000
25-34    150000
35-44    180000
45-54    130000
55+      120000
Name: LIMIT_BAL, dtype: int64

Likelihood of default

Age Bracket
18-24    0.271881
25-34    0.202982
35-44    0.218563
45-54    0.239310
55+      0.266857
Name: default payment next month, dtype: float64

In [9]:
#By all combinations of sex, education, and age bracket
grouped_data = data.groupby(['SEX', 'MARRIAGE', 'EDUCATION', 'Age Bracket'])
print "Median debt\n"
print grouped_data.LIMIT_BAL.median()
print "\nLikelihood of default"
print "\n", grouped_data['default payment next month'].mean()

Median debt

SEX     MARRIAGE  EDUCATION        Age Bracket
FEMALE  married   graduate school  18-24           50000
                                   25-34          210000
                                   35-44          230000
                                   45-54          235000
                                   55+            250000
                  high school      18-24           45000
                                   25-34           90000
                                   35-44          110000
                                   45-54           80000
                                   55+             80000
                  others           18-24           70000
                                   25-34          185000
                                   35-44          225000
                                   45-54          295000
                                   55+            240000
                  university       18-24           50000
                                   25-34          130000
                                   35-44          150000
                                   45-54          140000
                                   55+            140000
        others    graduate school  18-24           20000
                                   25-34          150000
                                   35-44          340000
                                   45-54          120000
                                   55+            150000
                  high school      18-24           50000
                                   25-34           55000
                                   35-44           50000
                                   45-54           50000
                                   55+             55000
                                                   ...
MALE    others    graduate school  55+            125000
                  high school      18-24           15000
                                   25-34           90000
                                   35-44           60000
                                   45-54           30000
                                   55+             50000
                  others           25-34          150000
                  university       18-24          130000
                                   25-34           50000
                                   35-44           50000
                                   45-54           50000
                                   55+             55000
        single    graduate school  18-24           30000
                                   25-34          170000
                                   35-44          210000
                                   45-54          200000
                                   55+            150000
                  high school      18-24           20000
                                   25-34           70000
                                   35-44           60000
                                   45-54           50000
                                   55+             40000
                  others           18-24           80000
                                   25-34          155000
                                   35-44          370000
                  university       18-24           30000
                                   25-34           90000
                                   35-44           80000
                                   45-54           50000
                                   55+            115000
Name: LIMIT_BAL, dtype: int64

Likelihood of default

SEX     MARRIAGE  EDUCATION        Age Bracket
FEMALE  married   graduate school  18-24          0.285714
                                   25-34          0.187063
                                   35-44          0.179512
                                   45-54          0.179412
                                   55+            0.283784
                  high school      18-24          0.270833
                                   25-34          0.247761
                                   35-44          0.235378
                                   45-54          0.258242
                                   55+            0.267760
                  others           18-24          0.000000
                                   25-34          0.000000
                                   35-44          0.062500
                                   45-54          0.000000
                                   55+            0.000000
                  university       18-24          0.321637
                                   25-34          0.228862
                                   35-44          0.210237
                                   45-54          0.234917
                                   55+            0.325758
        others    graduate school  18-24          1.000000
                                   25-34          0.166667
                                   35-44          0.000000
                                   45-54          0.000000
                                   55+            0.000000
                  high school      18-24          0.000000
                                   25-34          0.166667
                                   35-44          0.190476
                                   45-54          0.296296
                                   55+            0.250000
                                                    ...
MALE    others    graduate school  55+            0.333333
                  high school      18-24          0.500000
                                   25-34          0.000000
                                   35-44          0.428571
                                   45-54          0.294118
                                   55+            0.222222
                  others           25-34          0.000000
                  university       18-24          0.000000
                                   25-34          0.250000
                                   35-44          0.275862
                                   45-54          0.421053
                                   55+            0.000000
        single    graduate school  18-24          0.285714
                                   25-34          0.178999
                                   35-44          0.215139
                                   45-54          0.170000
                                   55+            0.160000
                  high school      18-24          0.314815
                                   25-34          0.270341
                                   35-44          0.241379
                                   45-54          0.214815
                                   55+            0.184211
                  others           18-24          0.000000
                                   25-34          0.111111
                                   35-44          0.000000
                  university       18-24          0.301802
                                   25-34          0.235612
                                   35-44          0.265372
                                   45-54          0.284884
                                   55+            0.157895
Name: default payment next month, dtype: float64

In [10]:
#Group with highest median credit
#Group with lowest median credit
#Group with highest percentage of defaults
#Group with lowest percentage of defaults

In [11]:
#derive som fields, e.g. amount owed, total amount paid

In [43]:
data.head()

,Age Bracket,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,18-24,20000,FEMALE,university,married,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,25-34,120000,FEMALE,university,single,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,25-34,90000,FEMALE,university,single,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,35-44,50000,FEMALE,university,married,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,55+,50000,MALE,university,married,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0